netify-soap/src/test/resources/soap/requests/actor/GetActorByIdRequestTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://mouthaan.org/namespace/netify/general">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:GetActorByIdRequest>
            <gen:id>33</gen:id>
        </gen:GetActorByIdRequest>
    </soapenv:Body>
</soapenv:Envelope>